---
kind: type
id: T:Autodesk.Revit.DB.NamingUtils
source: html/3c4e0c18-8133-ec1b-41a2-ed92c918e44c.htm
---
# Autodesk.Revit.DB.NamingUtils

A collection of utilities related to element naming.

## Syntax (C#)
```csharp
public static class NamingUtils
```